{
    "Site": {
        "latitude": {
            "type": "float",
            "required": true
        },
        "longitude": {
            "type": "float",
            "required": true
        }
    },
    "SpaceHeatingLoad": {
        "fuel_loads_mmbtu_per_hour": {
            "type": "array",
            "required": true,
            "description": "8760 timeseries",
            "note": "This parameter is required for formatting to run REopt's BAU for GHP module. Users need to get the accurate hourly fuel consumption to calculate BAU bills. If BAU system does not use fuel for heating (if BAU system uses electric heater for heating for example), please set this series at close to zeros (for ex: 0.0000001) and the electric heating load can be added to ElectricLoad"
        }
    },
    "DomesticHotWaterLoad": {
        "fuel_loads_mmbtu_per_hour": {
            "type": "array",
            "required": false,
            "description": "8760 timeseries",
            "note": "Only required if BAU system has DHW load and uses fuel for this load. If BAU system has no DHW load, or does not use fuel for DHW heating, set to values close to zeros. If BAU system uses electricity for DHW, please add this electric DHW load to ElectricLoad"
        }
    },
    "CoolingLoad": {
        "thermal_loads_ton": {
            "type": "array",
            "required": true,
            "description": "8760 timeseries",
            "note": "Only required if BAU system uses fuel for cooling. If BAU system uses electricity for cooling (AC), please add this load to ElectricLoad defined below. If BAU system has no cooling load, set to values close to zeros."
        }
    },
    "ElectricLoad": {
        "loads_kw": {
            "type": "array",
            "required": true,
            "description": "8760 timeseries",
            "note": "Electric load for BAU is different than for GHP scenario because it does not include GHP electric consumption. If the BAU uses electricity for cooling instead of fuel, please add the cooling electric load here. 15 min interval data do not work. Please make sure all timeseries are 8760"
        }
    },
    "ElectricTarriff": {
        "urdb_label": "string",
        "required": true
    },
    "ExistingBoiler": {
        "fuel_cost_per_mmbtu": {
            "type": "float",
            "required": false,
            "description": "Only required if BAU system use fuel for heating. In this case, fuel cost needs to be specified"
        }
    },
    "ExistingChiller": {
        "type": "float",
        "required": false,
        "description": "Only required if BAU system uses fuel for cooling. No need to define anything additional here"        
    },
    "ElectricHeater": {
        "installed_cost_per_mmbtu_per_hour": {
            "type": "float",
            "required": false,
            "description": "Only required if BAU system uses electricity for heating"
        },
        "can_serve_dhw": {
            "type": "Bool",
            "required": false,
            "description": "Only required if BAU system uses electricity for heating water"
        }
    }

}
    